app/Controllers/AccesoController.php

    public function autenticar()
    {
        $rules = [
            'username' => 'required|min_length[3]',
            'password' => 'required|min_length[4]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('toast_error', $this->validator->getErrors());
        }

        $username = trim((string) $this->request->getPost('username'));
        $password = (string) $this->request->getPost('password');

        $usuario = $this->usuarioModel
            ->select('
            tbl_ope_usuario.*,
            tbl_rel_persona.nombre,
            tbl_rel_persona.apellido_paterno,
            tbl_rel_persona.apellido_materno,
            tbl_cat_rol.nombre_rol,
            tbl_rel_image.ruta_archivo as imagen_perfil
        ')
            ->join('tbl_rel_persona', 'tbl_rel_persona.id_persona = tbl_ope_usuario.fk_persona', 'left')
            ->join('tbl_cat_rol', 'tbl_cat_rol.id_rol = tbl_ope_usuario.fk_rol', 'left')
            ->join('tbl_rel_image', 'tbl_rel_image.id_image = tbl_ope_usuario.fk_image_perfil', 'left')
            ->where('tbl_ope_usuario.username', $username)
            ->first();
---
SELECT `tbl_ope_usuario`.*, `tbl_rel_persona`.`nombre`, `tbl_rel_persona`.`apellido_paterno`, `tbl_rel_persona`.`apellido_materno`, `tbl_cat_rol`.`nombre_rol`, `tbl_rel_image`.`ruta_archivo` as `imagen_perfil`
FROM `tbl_ope_usuario`
LEFT JOIN `tbl_rel_persona` ON `tbl_rel_persona`.`id_persona` = `tbl_ope_usuario`.`fk_persona`
LEFT JOIN `tbl_cat_rol` ON `tbl_cat_rol`.`id_rol` = `tbl_ope_usuario`.`fk_rol`
LEFT JOIN `tbl_rel_image` ON `tbl_rel_image`.`id_image` = `tbl_ope_usuario`.`fk_image_perfil`
WHERE `tbl_ope_usuario`.`username` = 'kachbent-admin'
 LIMIT 1