app/Controllers/PerfilController.php

    public function index()
    {
        if (!session('isLoggedIn')) {
            return redirect()->to('/acceso/login')
                ->with('toast_error', 'Debes iniciar sesión para acceder a tu perfil');
        }

        $idUsuario = session('id_usuario');
        $fkPersona = session('fk_persona');

        $usuario = $this->usuarioModel
            ->select('tbl_ope_usuario.*, tbl_rel_image.ruta_archivo as imagen_perfil')
            ->join('tbl_rel_image', 'tbl_rel_image.id_image = tbl_ope_usuario.fk_image_perfil', 'left')
            ->find($idUsuario);
---
SELECT `tbl_ope_usuario`.*, `tbl_rel_image`.`ruta_archivo` as `imagen_perfil`
FROM `tbl_ope_usuario`
LEFT JOIN `tbl_rel_image` ON `tbl_rel_image`.`id_image` = `tbl_ope_usuario`.`fk_image_perfil`
WHERE `tbl_ope_usuario`.`id_usuario` = '2'